### patient detail

In [2]:
import pandas as pd
import numpy as np

In [3]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [4]:
x1=np.random.randint(1,50,10)
print("x1= ",x1)

x1=  [44  9 28 45 22 40  1 19 10 22]

In [7]:
p1=np.random.randint(25,100,5)
p2=np.random.randint(25,100,5)
p3=np.random.randint(25,100,5)
p4=np.random.randint(25,100,5)
p5=np.random.randint(25,100,5)

In [8]:
ds1=pd.DataFrame({"person_1":p1,"person_2":p2,"person_3":p3,"person_4":p4,"person_5":p5},index=["tamil","eng","math","science","social"])

In [9]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          68        58        52        57        31
eng            27        67        87        45        88
math           74        57        75        86        92
science        58        31        35        35        84
social         74        96        66        81        34

In [10]:
ds1["person_2"]

tamil      58
eng        67
math       57
science    31
social     96
Name: person_2, dtype: int64

In [11]:
ds1["person_2"].sum()

309

In [12]:
ds1["person_2"][3]=41

In [13]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          68        58        52        57        31
eng            27        67        87        45        88
math           74        57        75        86        92
science        58        41        35        35        84
social         74        96        66        81        34

In [14]:
ds1[ds1<35]

         person_1  person_2  person_3  person_4  person_5
tamil         NaN       NaN       NaN       NaN      31.0
eng          27.0       NaN       NaN       NaN       NaN
math          NaN       NaN       NaN       NaN       NaN
science       NaN       NaN       NaN       NaN       NaN
social        NaN       NaN       NaN       NaN      34.0

In [15]:
# ds1.idxmax()
ds1[ds1<35]=40

In [16]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil          68        58        52        57        40
eng            40        67        87        45        88
math           74        57        75        86        92
science        58        41        35        35        84
social         74        96        66        81        40

In [18]:
ds1.idxmin()

person_1        eng
person_2    science
person_3    science
person_4    science
person_5      tamil
dtype: object

In [20]:
me=ds1.mean().T

In [21]:
ds1.loc["mean"]=me

In [22]:
ds1

         person_1  person_2  person_3  person_4  person_5
tamil        68.0      58.0      52.0      57.0      40.0
eng          40.0      67.0      87.0      45.0      88.0
math         74.0      57.0      75.0      86.0      92.0
science      58.0      41.0      35.0      35.0      84.0
social       74.0      96.0      66.0      81.0      40.0
mean         62.8      63.8      63.0      60.8      68.8

In [23]:
ds1.rank()

         person_1  person_2  person_3  person_4  person_5
tamil         4.0       3.0       2.0       3.0       1.5
eng           1.0       5.0       6.0       2.0       5.0
math          5.5       2.0       5.0       6.0       6.0
science       2.0       1.0       1.0       1.0       4.0
social        5.5       6.0       4.0       5.0       1.5
mean          3.0       4.0       3.0       4.0       3.0